---
kind: type
id: T:Autodesk.Revit.DB.FamilySource
source: html/d8554318-b292-2a6c-590a-c2af54c49ad6.htm
---
# Autodesk.Revit.DB.FamilySource

Describes which version of the family to be loaded.

## Syntax (C#)
```csharp
public enum FamilySource
```